#+TITLE: loc
#+DATE: 2024-08-17T17:52:51+0800
#+LASTMOD: 2024-09-01T11:49:49+0800
#+TYPE: docs
#+DESCRIPTION: Lines of code

#+begin_src bash :results verbatim :exports result :dir ../../..
./zig-out/bin/loc
#+end_src

#+RESULTS:
#+begin_example
┌───────────┬───────┬────────┬───────┬──────────┬────────┬──────────┐
│Language   │File   │Line    │Code   │Comment   │Blank   │Size      │
├───────────┼───────┼────────┼───────┼──────────┼────────┼──────────┤
│Zig        │363    │10808   │9369   │1050      │389     │632.19K   │
│YAML       │8      │317     │292    │4         │21      │7.84K     │
│TOML       │1      │32      │27     │0         │5       │698.00B   │
│Makefile   │1      │23      │16     │0         │7       │365.00B   │
│Python     │1      │10      │7      │2         │1       │166.00B   │
│C          │1      │9       │2      │4         │3       │34.00B    │
│Ruby       │1      │8       │5      │2         │1       │201.00B   │
│Markdown   │1      │5       │5      │0         │0       │102.00B   │
│CHeader    │1      │2       │2      │0         │0       │44.00B    │
│JSON       │2      │2       │2      │0         │0       │247.00B   │
├───────────┼───────┼────────┼───────┼──────────┼────────┼──────────┤
│Total      │380    │11216   │9727   │1062      │427     │641.84K   │
└───────────┴───────┴────────┴───────┴──────────┴────────┴──────────┘

#+end_example
